export type TCode =
    | 'AA01'
    | 'AA02'
    | 'AA03'
    | 'AA04'
    | 'AA05'
    | 'AA06'
    | 'AA07'
    | 'AA08'
    | 'AA09'
    | 'AA10'
    | 'AA11'
    | 'AA12'
    | 'AA13'
    | 'AA14'
    | 'AA15'
    | 'AA16'
    | 'AA17'
    | 'AA18'
    | 'AA19'
    | 'AA20'
    | 'AA21'
    | 'AA22'
    | 'AB01'
    | 'AB02'
    | 'AB03'
    | 'AB04'
    | 'AB05'
    | 'AB06'
    | 'AC01'
    | 'AC02'
    | 'AC03'
    | 'AD01'
    | 'AD02'
    | 'AD03'
    | 'AD04'
    | 'AD05'
    | 'AD06'
    | 'AD07'
    | 'AD08'
    | 'AE01'
    | 'AE02'
    | 'AE03'
    | 'AE04'
    | 'AE05'
    | 'AE06'
    | 'AE07'
    | 'AF01'
    | 'AF02'
    | 'AF03'
    | 'AF04';

export const codeContentMap: Record<TCode, { content: string }> = {
    AA01: {
        content: '進入施工區域已正確配戴安全帽並扣上帽帶。',
    },
    AA02: {
        content: '穿著及膝之長褲及覆肩之上衣。',
    },
    AA03: {
        content: '人員無嚼食檳榔、追逐嬉戲、賭博、打架等行為。',
    },
    AA04: {
        content: '人員未攜帶或飲用含酒精性飲料。',
    },
    AA05: {
        content: '未攜帶管制物品(如：照相機、NOTEBOOK、磁片、打火機…等)。',
    },
    AA06: {
        content: '施工人員無酒醉、吸毒或精神不能集中等異常現象。',
    },
    AA07: {
        content:
            '施工區、預置區、堆放區已設置圍籬及標示廠商名稱、連絡人及電話。',
    },
    AA08: {
        content: '現場地面放置工具、物料已舖設塑膠布或不鏽鋼板。',
    },
    AA09: {
        content:
            '在樓梯、通道上、緊急疏散路線、沖身洗眼器、逃生門以及緊急應變用品櫃附近，堆放機具、材料者。',
    },
    AA10: {
        content: '將工具、材料置於安全處。',
    },
    AA11: {
        content: '於指定區域用餐、飲食、休息。',
    },
    AA12: {
        content: '於指定地點抽煙。',
    },
    AA13: {
        content: '車輛持有通行證、依規定停放、未阻礙通道。',
    },
    AA14: {
        content: '行車未超過速限/未逆向行駛。',
    },
    AA15: {
        content:
            '未任意拆除或挪用機電設備、警告標誌、防護設備、消防設施(含消防管或滅火器移做他用)….等。',
    },
    AA16: {
        content: '已申請拆除安全設施(如：安全網、平台護欄….等)。',
    },
    AA17: {
        content:
            '施工現場已無其他方式須直接踐踏機台、管路等，且已事先向管理單位申請許可。',
    },
    AA18: {
        content: '轉動任一管路之閥類開關或電氣開關前已通知相關負責人員。',
    },
    AA19: {
        content: '下班收工後已將電氣設備、氣體鋼瓶關閉。',
    },
    AA20: {
        content: '現場作業時正確配帶個人防護具。',
    },
    AA21: {
        content: '未在廠內隨地便溺。',
    },
    AA22: {
        content: '已復原安全設施(如：安全網、平台護欄….等) 。',
    },
    AB01: {
        content: '每日工程收工前，整理現場、收拾工具，使之恢復正常狀況。',
    },
    AB02: {
        content: '每日工作後，將自動昇降機、A字梯、施工架等歸回定位。',
    },
    AB03: {
        content: '每日工作後，將作業平台上工具及施工物件、材料等收拾完成。',
    },
    AB04: {
        content:
            '庫存區、預置區、堆放區之機具、材料已分類、標示，廢棄物當日清除。',
    },
    AB05: {
        content: '每日收工前將物料、工具置於暫存區並將當日垃圾清理乾淨。',
    },
    AB06: {
        content: '生活廢棄物依照各區垃圾分類規定丟棄於各分類垃圾桶內。',
    },
    AC01: {
        content: '作業許可證或其他規定表格標示於現場明顯處。',
    },
    AC02: {
        content: '實施作業自主檢點或機具檢點、檢查。',
    },
    AC03: {
        content: '進行切管、修改等作業前，已經管理單位、人員確認無誤。',
    },
    AD01: {
        content: '施工人員正確配戴識別證及穿著施工背心。',
    },
    AD02: {
        content: '入廠施工人員依規定接受相關工安訓練課程。',
    },
    AD03: {
        content: '人員未持來賓證進入廠區施作。',
    },
    AD04: {
        content: '證件未借與他人或未冒用他人證件進出廠區。',
    },
    AD05: {
        content: '已事先獲得管理人員許可才入廠施工。',
    },
    AD06: {
        content: '未出入非經許可之區域(依識別證門禁區域判別)。',
    },
    AD07: {
        content: '未於非緊急狀態違規打開或進出安全門。',
    },
    AD08: {
        content: '未闖越簽到、讀卡、換證等門禁管制區域。',
    },
    AE01: {
        content: '符合無塵室穿著規定。',
    },
    AE02: {
        content: '設備材料機具進入無塵室，已擦拭乾淨及存放於規定區域。',
    },
    AE03: {
        content: '於無塵室施工已做好潔淨措施。',
    },
    AE04: {
        content: '施工時人員未直接坐於地面上。',
    },
    AE05: {
        content: '未嚼食口香糖。',
    },
    AE06: {
        content:
            '未攜帶管制物品(如：照相機、NOTEBOOK、磁片、鉛筆、非無塵紙、立可白、紙箱、行動電話、打火機…等)。',
    },
    AE07: {
        content: '遵守其他無塵室相關規定。',
    },
    AF01: {
        content: '遵守每日出工人員簽到規定。',
    },

    AF02: {
        content: '依規定繳交相關文件。',
    },
    AF03: {
        content: '出席『供應商安全衛生會議』。',
    },
    AF04: {
        content: '遵守其他安全、管理相關規定。',
    },
};
