export type TCode =
    | 'AA01'
    | 'AA02'
    | 'AA03'
    | 'AA04'
    | 'AA05'
    | 'AA06'
    | 'AA07'
    | 'AA08'
    | 'AA09'
    | 'AA10'
    | 'AA11'
    | 'AA12'
    | 'AA13'
    | 'AA14'
    | 'AA15'
    | 'AA16'
    | 'AA17'
    | 'AA18'
    | 'AA19'
    | 'AA20'
    | 'AA21'
    | 'AA22'
    | 'AB01'
    | 'AB02'
    | 'AB03'
    | 'AB04'
    | 'AB05'
    | 'AB06'
    | 'AC01'
    | 'AC02'
    | 'AC03'
    | 'AD01'
    | 'AD02'
    | 'AD03'
    | 'AD04'
    | 'AD05'
    | 'AD06'
    | 'AD07'
    | 'AD08'
    | 'AE01'
    | 'AE02'
    | 'AE03'
    | 'AE04'
    | 'AE05'
    | 'AE06'
    | 'AE07'
    | 'AF01'
    | 'AF02'
    | 'AF03'
    | 'AF04'
    | 'BA01'
    | 'BA02'
    | 'BA03'
    | 'BA04'
    | 'BA05'
    | 'BA06'
    | 'BA07'
    | 'BA08'
    | 'BA09'
    | 'BB01'
    | 'BB02'
    | 'BB03'
    | 'BB04'
    | 'BB05'
    | 'BB06'
    | 'BB07'
    | 'BB08'
    | 'BB09'
    | 'BB10'
    | 'BB11'
    | 'BB12'
    | 'BB13'
    | 'BB14'
    | 'BB15'
    | 'BB16'
    | 'BB17'
    | 'BC01'
    | 'BC02'
    | 'BC03'
    | 'BC04'
    | 'BC05'
    | 'BC06'
    | 'BC07'
    | 'BC08'
    | 'BC09'
    | 'BC10'
    | 'BC11'
    | 'BD01'
    | 'BD02'
    | 'BD03'
    | 'BD04'
    | 'BD05'
    | 'BD06'
    | 'BD07'
    | 'BD08'
    | 'BD09'
    | 'BD10'
    | 'BD11'
    | 'BD12'
    | 'BD13'
    | 'BD14'
    | 'BD15'
    | 'BD16'
    | 'BE01'
    | 'BE02'
    | 'BE03'
    | 'BE04'
    | 'BF01'
    | 'BF02'
    | 'BF03'
    | 'BF04'
    | 'BF05'
    | 'BF06'
    | 'BF07'
    | 'BF08'
    | 'BF09'
    | 'BF10'
    | 'BF11'
    | 'BG01'
    | 'BG02'
    | 'BG03'
    | 'BG04'
    | 'BG05'
    | 'BG06'
    | 'BG07'
    | 'BH01'
    | 'BH02'
    | 'BH03'
    | 'BH04'
    | 'BI01'
    | 'BI02'
    | 'BI03'
    | 'BJ01'
    | 'BJ02'
    | 'BJ03'
    | 'BJ04'
    | 'BJ05';

export const codeContentMap: Record<TCode, { content: string }> = {
    AA01: {
        content: '進入施工區域已正確配戴安全帽並扣上帽帶。',
    },
    AA02: {
        content: '穿著及膝之長褲及覆肩之上衣。',
    },
    AA03: {
        content: '人員無嚼食檳榔、追逐嬉戲、賭博、打架等行為。',
    },
    AA04: {
        content: '人員未攜帶或飲用含酒精性飲料。',
    },
    AA05: {
        content: '未攜帶管制物品(如：照相機、NOTEBOOK、磁片、打火機…等)。',
    },
    AA06: {
        content: '施工人員無酒醉、吸毒或精神不能集中等異常現象。',
    },
    AA07: {
        content:
            '施工區、預置區、堆放區已設置圍籬及標示廠商名稱、連絡人及電話。',
    },
    AA08: {
        content: '現場地面放置工具、物料已舖設塑膠布或不鏽鋼板。',
    },
    AA09: {
        content:
            '在樓梯、通道上、緊急疏散路線、沖身洗眼器、逃生門以及緊急應變用品櫃附近，堆放機具、材料者。',
    },
    AA10: {
        content: '將工具、材料置於安全處。',
    },
    AA11: {
        content: '於指定區域用餐、飲食、休息。',
    },
    AA12: {
        content: '於指定地點抽煙。',
    },
    AA13: {
        content: '車輛持有通行證、依規定停放、未阻礙通道。',
    },
    AA14: {
        content: '行車未超過速限/未逆向行駛。',
    },
    AA15: {
        content:
            '未任意拆除或挪用機電設備、警告標誌、防護設備、消防設施(含消防管或滅火器移做他用)….等。',
    },
    AA16: {
        content: '已申請拆除安全設施(如：安全網、平台護欄….等)。',
    },
    AA17: {
        content:
            '施工現場已無其他方式須直接踐踏機台、管路等，且已事先向管理單位申請許可。',
    },
    AA18: {
        content: '轉動任一管路之閥類開關或電氣開關前已通知相關負責人員。',
    },
    AA19: {
        content: '下班收工後已將電氣設備、氣體鋼瓶關閉。',
    },
    AA20: {
        content: '現場作業時正確配帶個人防護具。',
    },
    AA21: {
        content: '未在廠內隨地便溺。',
    },
    AA22: {
        content: '已復原安全設施(如：安全網、平台護欄….等) 。',
    },
    AB01: {
        content: '每日工程收工前，整理現場、收拾工具，使之恢復正常狀況。',
    },
    AB02: {
        content: '每日工作後，將自動昇降機、A字梯、施工架等歸回定位。',
    },
    AB03: {
        content: '每日工作後，將作業平台上工具及施工物件、材料等收拾完成。',
    },
    AB04: {
        content:
            '庫存區、預置區、堆放區之機具、材料已分類、標示，廢棄物當日清除。',
    },
    AB05: {
        content: '每日收工前將物料、工具置於暫存區並將當日垃圾清理乾淨。',
    },
    AB06: {
        content: '生活廢棄物依照各區垃圾分類規定丟棄於各分類垃圾桶內。',
    },
    AC01: {
        content: '作業許可證或其他規定表格標示於現場明顯處。',
    },
    AC02: {
        content: '實施作業自主檢點或機具檢點、檢查。',
    },
    AC03: {
        content: '進行切管、修改等作業前，已經管理單位、人員確認無誤。',
    },
    AD01: {
        content: '施工人員正確配戴識別證及穿著施工背心。',
    },
    AD02: {
        content: '入廠施工人員依規定接受相關工安訓練課程。',
    },
    AD03: {
        content: '人員未持來賓證進入廠區施作。',
    },
    AD04: {
        content: '證件未借與他人或未冒用他人證件進出廠區。',
    },
    AD05: {
        content: '已事先獲得管理人員許可才入廠施工。',
    },
    AD06: {
        content: '未出入非經許可之區域(依識別證門禁區域判別)。',
    },
    AD07: {
        content: '未於非緊急狀態違規打開或進出安全門。',
    },
    AD08: {
        content: '未闖越簽到、讀卡、換證等門禁管制區域。',
    },
    AE01: {
        content: '符合無塵室穿著規定。',
    },
    AE02: {
        content: '設備材料機具進入無塵室，已擦拭乾淨及存放於規定區域。',
    },
    AE03: {
        content: '於無塵室施工已做好潔淨措施。',
    },
    AE04: {
        content: '施工時人員未直接坐於地面上。',
    },
    AE05: {
        content: '未嚼食口香糖。',
    },
    AE06: {
        content:
            '未攜帶管制物品(如：照相機、NOTEBOOK、磁片、鉛筆、非無塵紙、立可白、紙箱、行動電話、打火機…等)。',
    },
    AE07: {
        content: '遵守其他無塵室相關規定。',
    },
    AF01: {
        content: '遵守每日出工人員簽到規定。',
    },

    AF02: {
        content: '依規定繳交相關文件。',
    },
    AF03: {
        content: '出席『供應商安全衛生會議』。',
    },
    AF04: {
        content: '遵守其他安全、管理相關規定。',
    },
    BA01: {
        content: '作業現場備有正確、足夠之滅火器，且有效期限未過期。',
    },
    BA02: {
        content: '作業現場易燃物已移除或加以防護。',
    },
    BA03: {
        content: '氣體鋼瓶集中時，保持豎立，或使用專用手推車搬運氣體鋼瓶。',
    },
    BA04: {
        content: '氣體鋼瓶使用鐵鍊、非彈性繩索固定，或每日作業後裝妥護蓋。',
    },
    BA05: {
        content: '焊接機具裝設有效之自動電擊防止裝置及漏電斷路器。',
    },
    BA06: {
        content: '氧氣鋼瓶裝有合乎規格之專用減壓調節器及防爆逆止閥。',
    },
    BA07: {
        content: '高處動火有以耐燃材料阻隔、收集、抑制火星四散或掉落。',
    },
    BA08: {
        content: '焊接時使用絕緣良好之安全手把、配戴盔帽及遮光玻璃。',
    },
    BA09: {
        content:
            '焊接地線已儘可能接近焊接點，電流迴路無經其它設備而導致跳電之虞。',
    },
    BB01: {
        content:
            '依照施工地點之地形、地物使用下列之安全器具：(a)施工架/作業平台(含牢固護欄)(b)自動升降機(c)安全帶(d)安全網(e)A字梯(f)安全母索(g)其他防墜措施。',
    },
    BB02: {
        content:
            '未僱用下列人員從事高架作業：(a)患有高血壓、心血管疾病或貧血者(b)曾患有癲癇精神或神精疾病(c)平衡機能失常者(d)患有哮喘症者(e)四肢不全者(f)色盲者(g)聽力不正常者(h)酗酒者(i)身體虛弱者(j)情緒不佳有安全顧慮者(k)年齡未滿十八歲或超過五十五歲者。',
    },
    BB03: {
        content: '施工架上未再搭接梯子或踏凳等從事作業。',
    },
    BB04: {
        content: '移動式施工架於定位時應踩下車輪煞車器固定。',
    },
    BB05: {
        content: '人員位於施工架上時，未移動施工架。',
    },
    BB06: {
        content:
            '施工使用A字梯時，以一人在梯上一人在下扶持A字梯之夥同方式作業(作業廠區規定時適用) 。',
    },
    BB07: {
        content: '未使用損毀凹陷的A字梯、施工架。',
    },
    BB08: {
        content: '高差超過1.5公尺以上之場所，使用人員能安全上下之設備。',
    },
    BB09: {
        content: '未從高處投下物體，或使用適當之承受設備。',
    },
    BB10: {
        content:
            '高空工作車應標示空重、載重、額定荷重等，且不得超過高空工作車之積載荷重及能力。',
    },
    BB11: {
        content:
            '高空工作車事先應視作業場所之狀況、工作台高度、伸臂長度及作業場所地形等，規定適當之行駛速率，操作人員應依規定操作。',
    },
    BB12: {
        content:
            '在工作台以外之處所操作工作台時，操作人員與工作台上之人員間應規定統一指揮信號，並依信號從事指揮作業。',
    },
    BB13: {
        content:
            '除乘坐席位及工作台外不得搭載人員，且作業時禁止非相關人員進入操作半徑內，或附近有危險之虞之場所。',
    },
    BB14: {
        content: '應將其外伸撐座完全伸出，並採取防止地盤沉陷或崩塌等必要措施。',
    },
    BB15: {
        content: '高空工作車禁止停放斜坡，除非已採有安全措施。',
    },
    BB16: {
        content:
            '使用高空工作車從事作業時，工作台上的人員應佩帶背負式安全帶，工作台出入口處應有確保防止人員墜落的安全設施。',
    },
    BB17: {
        content:
            '工作車移動時，應將工作台下降至最低位置；若不使用時應確實使用制動裝置保持高空工作車於穩定狀態。',
    },
    BC01: {
        content:
            '已對局限空間進行氧氣含量及有害物濃度測試合格後才進入作業。(O2濃度18~21%)',
    },
    BC02: {
        content: '缺氧作業主管於現場全程監督作業安全。',
    },
    BC03: {
        content: '人體有害物質已做妥隔離、遮斷、盲封、清除。',
    },
    BC04: {
        content: '作業現場備有良好且正確運作之通風設備。',
    },
    BC05: {
        content: '人員經許可後，再進入局限空間。',
    },
    BC06: {
        content: '許可進入局限空間作業之人員已載明進入時間及期限。',
    },
    BC07: {
        content: '引火性液體之蒸氣或可燃性氣體之濃度不得超過其爆炸下限之30%。',
    },
    BC08: {
        content: '人員應配戴適當之呼吸防護具(濾過式、供氣式呼吸防護具等)。',
    },
    BC09: {
        content: '已訂定危害防止計劃供依循。',
    },
    BC10: {
        content: '於作業場所顯而易見處公告禁止進入。',
    },
    BC11: {
        content: '防護設備及救援設備已準備。',
    },
    BD01: {
        content: '插頭依規定格式標示公司名稱、連絡人及連絡電話。',
    },
    BD02: {
        content: '使用之電線、插頭無破損或絕緣不良之現象。',
    },
    BD03: {
        content:
            '電線橫越道路及車輛行駛較頻繁之場所，以管路埋設地下或以厚鋼管、槽鐵等掩護或架高配設，且未形成通行障礙。',
    },
    BD04: {
        content: '使用經檢驗合格之電器設備。',
    },
    BD05: {
        content: '未以電線或其他金屬代替保險絲。',
    },
    BD06: {
        content: '施工用電使用〝施工專用電盤〞接電。',
    },
    BD07: {
        content: '使用〝施工專用電盤〞由上下開孔接電，不會妨礙電盤門開閉。',
    },
    BD08: {
        content: '危險地區加裝護欄及掛有安全標示。',
    },
    BD09: {
        content: '電氣設備遠離易燃品或有適當防護。',
    },
    BD10: {
        content:
            '非指定人員未隨意開動或關閉機械設備，以及工作起動後有關電氣設備部分之使用，經機械、設備之管理人員許可。',
    },
    BD11: {
        content:
            '馬達、穿孔器、一般常用之測試儀器及電動手工具，具有良好之絕緣設備，才可使用。',
    },
    BD12: {
        content: '電動工具使用前，依規定接地。',
    },
    BD13: {
        content: '電動工具裝設良好絕緣插頭，未以裸接方式直接插入插座上。',
    },
    BD14: {
        content: '在潮溼地區著乾燥之橡膠鞋及絕緣等措施，才使用電動手工具。',
    },
    BD15: {
        content: '使用之延長線有過載保護裝置。',
    },
    BD16: {
        content: '活線或臨時斷/供電作業，已標示、隔離，且作業後復原環境。',
    },
    BE01: {
        content: '吊籠經檢查合格取得檢查合格證。',
    },
    BE02: {
        content: '操作人員經教育訓練合格，領有結業證書。',
    },
    BE03: {
        content: '每次作業前確實做好檢點工作。',
    },
    BE04: {
        content: '作業人員確實使用防墜落裝置。',
    },
    BF01: {
        content: '於吊掛現場設置警告標誌且有專人管制人員通行。',
    },
    BF02: {
        content: '使用之起重機具經檢查合格取得檢查合格證。',
    },
    BF03: {
        content: '起重機具標示最高負荷，且未超過此項限制。',
    },
    BF04: {
        content: '起重機具之吊鉤，有防止吊舉中所吊物體脫落之安全防滑舌片。',
    },
    BF05: {
        content: '設置/使用過捲揚預防裝置。',
    },
    BF06: {
        content: '作業現場有一人以上執行吊掛指揮、督導。',
    },
    BF07: {
        content: '人員未由吊掛現場下方通過。',
    },
    BF08: {
        content: '使用、操作危險性機械設備，持有合格操作證照。',
    },
    BF09: {
        content: '實施作業前檢點。',
    },
    BF10: {
        content: '機械運轉時有警示燈或蜂鳴裝置。',
    },
    BF11: {
        content: '未以起重機或吊掛機為人員升降工具。',
    },
    BG01: {
        content: '施工架組配作業主管於現場全程監督作業安全。',
    },
    BG02: {
        content: '施工架組配之基腳無沈陷之虞。',
    },
    BG03: {
        content: '遇地震時立即停止作業，使人員退避至安全避難場所。',
    },
    BG04: {
        content: '地震或地質變化後，徹底檢查施工架後再行作業。',
    },
    BG05: {
        content: '確實完成組配施工架之安全設備（如插銷、交叉連桿等）。',
    },
    BG06: {
        content: '施工架組配物料運送前確實綁紮，無掉落之虞。',
    },
    BG07: {
        content: '施工架組配作業靠近電線、輸配電設備，有護圍、絕緣或掩蔽。',
    },
    BH01: {
        content: '舊電力、化學或氣體管線拆除前，確認管內已無殘留危害物程序。',
    },
    BH02: {
        content: '管線清洗、拆離前，人員確實穿著防護用具。',
    },
    BH03: {
        content: '作業時，主管在現場場督導。',
    },
    BH04: {
        content: '管路拆除範圍，有防止非相關人員進入之標示及管制措施。',
    },
    BI01: {
        content: '工作場所之地面或牆壁如有開口，已裝設護欄或蓋板。',
    },
    BI02: {
        content: '移開高架地板施工前，已先設置警示圍籬、標示。',
    },
    BI03: {
        content: '移開高架地板施工完畢後，已將高架地板復原並固定。',
    },
    BJ01: {
        content: '化學物質皆清楚標示。',
    },
    BJ02: {
        content: '化學物質使用完畢後，置於指定地點。',
    },
    BJ03: {
        content: '化學物質使用、處置、儲存、作業，備有物質安全資料表(MSDS)。',
    },
    BJ04: {
        content: '可能產生危害之區域，設有警告標示及護欄。',
    },
    BJ05: {
        content: '化學物質作業，已穿戴適當的個人防護具。',
    },
};
